Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.MetadataItem
Represents a key-value pair in the metadata of a data product.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.MetadataItem.Key
Key of the metadata entry.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.MetadataItem.Value
Value of the metadata entry.